In [119]:
import seaborn as sns

In [120]:
iris = sns.load_dataset('iris')

In [121]:
iris.duplicated().sum()

1

In [122]:
iris_dup =  iris.copy()
iris_dup.iloc[132, : ] = iris.iloc[130, :]

In [123]:
iris_dup.duplicated().sum()

2

# 문제1 : 위와 같이 iris에 중복된 행이 1개 있으며 iris_dup에 중복된 행이 2개 있다. iris의 중복된 행은 남기고 iris_dup의 중복된 데이터중 인덱스 번호가 먼저인 행을 삭제하라

In [125]:
iris.loc[iris.duplicated()]

     sepal_length  sepal_width  petal_length  petal_width    species
142           5.8          2.7           5.1          1.9  virginica

In [126]:
iris_dup.loc[iris_dup.duplicated()]

     sepal_length  sepal_width  petal_length  petal_width    species
132           7.4          2.8           6.1          1.9  virginica
142           5.8          2.7           5.1          1.9  virginica

In [127]:
iris_dup.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [51]:
type(iris.loc[132,'sepal_length'])

numpy.float64

In [52]:
iris_dup.loc[(iris_dup['sepal_length'] == 7.4) & (iris_dup['sepal_width'] == 2.8) 
         & (iris_dup['petal_length'] == 6.1) & (iris_dup['petal_width'] == 1.9) & (iris_dup['species'] == 'virginica'),:]

     sepal_length  sepal_width  petal_length  petal_width    species
130           7.4          2.8           6.1          1.9  virginica
132           7.4          2.8           6.1          1.9  virginica

In [129]:
iris_dup.drop(130).head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [137]:
iris_dup.loc[130]

sepal_length          7.4
sepal_width           2.8
petal_length          6.1
petal_width           1.9
species         virginica
Name: 130, dtype: object

# 문제2 다음은 두사람의 다이어트 기록이다 찬준의 결측치를 적절히 채우고 5월의 기대체중을 예상해보자

In [102]:
import pandas as pd

In [111]:
import numpy as np

In [112]:
diet_log = pd.DataFrame([[72,62],[69,59],[66,np.nan],[63,53]], index = ['1월','2월','3월','4월'], columns = ['지완','찬준'])

In [113]:
diet_log

    지완    찬준
1월  72  62.0
2월  69  59.0
3월  66   NaN
4월  63  53.0

In [114]:
diet_log2 = diet_log.interpolate()

In [117]:
diet_log2.loc['5월',:] = [60,50]

In [118]:
diet_log2

      지완    찬준
1월  72.0  62.0
2월  69.0  59.0
3월  66.0  56.0
4월  63.0  53.0
5월  60.0  50.0